In [1]:
import pandas as pd
import numpy as np

In [ ]:
pricepaid2017.csv is the dataset downloaded from UK land registry on 21 June 2017
https://www.gov.uk/government/statistical-data-sets/price-paid-data-downloads
Data produced by HM Land Registry © Crown copyright 2017.
Dataset used for educational purpose only

In [ ]:
Let us take take this dataset and try to do some data exploration

In [8]:
ld = pd.read_csv('pricepaid2017.csv', header = None)

In [9]:
ld.describe()

                  1
count  2.150320e+05
mean   3.243298e+05
std    9.594755e+05
min    1.000000e+00
25%    1.350000e+05
50%    2.150000e+05
75%    3.400000e+05
max    1.255000e+08

In [55]:
ld['Price Paid'].describe()

count    2.150320e+05
mean     3.243298e+05
std      9.594755e+05
min      1.000000e+00
25%      1.350000e+05
50%      2.150000e+05
75%      3.400000e+05
max      1.255000e+08
Name: Price Paid, dtype: float64

In [ ]:
You can see the avg house bought is £324329 and max price paid is 1.25 * 10^8 = £125 million

In [63]:
ld.shape

(215032, 16)

In [64]:
ld['Price Paid'].max()

125500000

In [11]:
ld.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,{4E95D757-A215-EDA1-E050-A8C0630539E2},983000,2017-03-29 00:00,EN1 2PF,D,N,F,31,NaN,WELLINGTON ROAD,NaN,ENFIELD,ENFIELD,GREATER LONDON,A,A
1,{4E95D757-A216-EDA1-E050-A8C0630539E2},450000,2017-04-12 00:00,HA1 1PE,T,N,F,70,NaN,HEADSTONE ROAD,NaN,HARROW,HARROW,GREATER LONDON,A,A
2,{4E95D757-A217-EDA1-E050-A8C0630539E2},415000,2017-03-16 00:00,TW13 6TE,S,N,F,19,NaN,CONWAY ROAD,NaN,FELTHAM,HOUNSLOW,GREATER LONDON,A,A
3,{4E95D757-A218-EDA1-E050-A8C0630539E2},472000,2017-03-31 00:00,UB6 9NY,S,N,F,95,NaN,CHINNOR CRESCENT,NaN,GREENFORD,EALING,GREATER LONDON,A,A
4,{4E95D757-A219-EDA1-E050-A8C0630539E2},682500,2017-03-06 00:00,W7 2JS,S,N,F,17,NaN,SEWARD ROAD,NaN,LONDON,EALING,GREATER LONDON,A,A

In [69]:
ld['Price Paid'].isnull().any()

False

In [72]:
ld[ld['Price Paid'] == ld['Price Paid'].max()]
#Now we know how to access the row of the data frame in pandas where one of the one of column value is max

,serial,Price Paid,Date,PostCode,House Type,N1,Freehold,No,No2,Road,Area,Town,Town2,Council,N2,N3
6429,{4E95D757-A812-EDA1-E050-A8C0630539E2},125500000,2017-02-27 00:00,WC2R 1AB,F,Y,L,"CLEMENT HOUSE, 190",APARTMENT 28,STRAND,NaN,LONDON,CITY OF WESTMINSTER,GREATER LONDON,A,A

In [ ]:
What! A flat in leasehold for 125.5 mn

In [75]:
ld[ld['Price Paid'] == ld['Price Paid'].min()]

,serial,Price Paid,Date,PostCode,House Type,N1,Freehold,No,No2,Road,Area,Town,Town2,Council,N2,N3
82960,{4E95D757-6007-EDA1-E050-A8C0630539E2},1,2017-03-30 00:00,SS3 0AT,S,N,F,48,NaN,VICTORIA DRIVE,GREAT WAKERING,SOUTHEND-ON-SEA,ROCHFORD,ESSEX,A,A

In [74]:
ld_clean = ld

In [73]:
ld_clean.head()

,Price Paid,Date,PostCode,House Type,Freehold,No,No2,Road,Area,Town,Town2,Council
0,983000,2017-03-29 00:00,EN1 2PF,D,F,31,NaN,WELLINGTON ROAD,NaN,ENFIELD,ENFIELD,GREATER LONDON
1,450000,2017-04-12 00:00,HA1 1PE,T,F,70,NaN,HEADSTONE ROAD,NaN,HARROW,HARROW,GREATER LONDON
2,415000,2017-03-16 00:00,TW13 6TE,S,F,19,NaN,CONWAY ROAD,NaN,FELTHAM,HOUNSLOW,GREATER LONDON
3,472000,2017-03-31 00:00,UB6 9NY,S,F,95,NaN,CHINNOR CRESCENT,NaN,GREENFORD,EALING,GREATER LONDON
4,682500,2017-03-06 00:00,W7 2JS,S,F,17,NaN,SEWARD ROAD,NaN,LONDON,EALING,GREATER LONDON

In [16]:
ld.columns = ['serial','Price Paid', 'Date', 'PostCode','House Type','N1','Freehold','No','No2','Road','Area','Town','Town2','Council','N2','N3']

In [19]:
ld_clean = ld.drop(['serial','N1','N2','N3'], axis = 1)

In [20]:
ld_clean.head()

,Price Paid,Date,PostCode,House Type,Freehold,No,No2,Road,Area,Town,Town2,Council
0,983000,2017-03-29 00:00,EN1 2PF,D,F,31,NaN,WELLINGTON ROAD,NaN,ENFIELD,ENFIELD,GREATER LONDON
1,450000,2017-04-12 00:00,HA1 1PE,T,F,70,NaN,HEADSTONE ROAD,NaN,HARROW,HARROW,GREATER LONDON
2,415000,2017-03-16 00:00,TW13 6TE,S,F,19,NaN,CONWAY ROAD,NaN,FELTHAM,HOUNSLOW,GREATER LONDON
3,472000,2017-03-31 00:00,UB6 9NY,S,F,95,NaN,CHINNOR CRESCENT,NaN,GREENFORD,EALING,GREATER LONDON
4,682500,2017-03-06 00:00,W7 2JS,S,F,17,NaN,SEWARD ROAD,NaN,LONDON,EALING,GREATER LONDON

In [22]:
ld_clean['Price Paid'].sum()
#This indicates the amount paid to land registry in the year 2017

1021798331

In [23]:
ld_clean.tail()

,Price Paid,Date,PostCode,House Type,Freehold,No,No2,Road,Area,Town,Town2,Council
215027,115000,2017-02-27 00:00,BD13 2QA,S,F,39,NaN,CHAPEL LANE,QUEENSBURY,BRADFORD,BRADFORD,WEST YORKSHIRE
215028,300000,2017-03-22 00:00,WF15 6HY,D,F,10,NaN,LOW HOUSE FOLD,NaN,LIVERSEDGE,KIRKLEES,WEST YORKSHIRE
215029,139000,2017-02-24 00:00,LS28 8DF,T,F,59,NaN,WATERLOO ROAD,NaN,PUDSEY,LEEDS,WEST YORKSHIRE
215030,277500,2017-04-13 00:00,LS26 0LW,S,F,65,NaN,HAIGH ROAD,ROTHWELL,LEEDS,LEEDS,WEST YORKSHIRE
215031,166000,2017-03-31 00:00,WF5 8NH,T,F,17,NaN,RYDALE COURT,NaN,OSSETT,WAKEFIELD,WEST YORKSHIRE

In [51]:
ld_clean.groupby(['House Type'])['Price Paid'].sum()

House Type
D    18396996213
F    10822577571
O    12512123295
S    13810621979
T    14198956009
Name: Price Paid, dtype: int64

In [80]:
ld_clean.groupby(['Freehold'])['Price Paid'].sum()

Freehold
F    54792829812
L    14948445255
Name: Price Paid, dtype: int64

In [95]:
council = ld_clean.groupby(['Council'])['Price Paid'].sum()/ld_clean['Price Paid'].sum()
#This gives the each councils contribution

In [96]:
council

Council
BATH AND NORTH EAST SOMERSET    0.274003
BEDFORD                         0.178112
BLACKBURN WITH DARWEN           0.060876
BLACKPOOL                       0.095377
BLAENAU GWENT                   0.018945
BOURNEMOUTH                     0.268903
BRACKNELL FOREST                0.201910
BRIDGEND                        0.081893
BRIGHTON AND HOVE               0.489794
BUCKINGHAMSHIRE                 0.973151
CAERPHILLY                      0.074847
CAMBRIDGESHIRE                  0.855396
CARDIFF                         0.311890
CARMARTHENSHIRE                 0.110716
CENTRAL BEDFORDSHIRE            0.544308
CEREDIGION                      0.047569
CHESHIRE EAST                   0.439261
CHESHIRE WEST AND CHESTER       0.331354
CITY OF BRISTOL                 0.588144
CITY OF DERBY                   0.165366
CITY OF KINGSTON UPON HULL      0.095882
CITY OF NOTTINGHAM              0.284720
CITY OF PETERBOROUGH            0.155910
CITY OF PLYMOUTH                0.248054
CONWY                           0.096616
CORNWALL                        0.709803
COUNTY DURHAM                   0.273703
CUMBRIA                         0.388247
DARLINGTON                      0.061256
DENBIGHSHIRE                    0.055097
                                  ...
SOMERSET                        0.761260
SOUTH GLOUCESTERSHIRE           0.325814
SOUTH YORKSHIRE                 0.889689
SOUTHAMPTON                     0.229150
SOUTHEND-ON-SEA                 0.256683
STAFFORDSHIRE                   0.772736
STOCKTON-ON-TEES                0.105024
STOKE-ON-TRENT                  0.120792
SUFFOLK                         0.846445
SURREY                          2.487673
SWANSEA                         0.144610
SWINDON                         0.210676
THE VALE OF GLAMORGAN           0.106983
THURROCK                        0.208041
TORBAY                          0.189977
TORFAEN                         0.042030
TYNE AND WEAR                   0.608903
WARRINGTON                      0.160179
WARWICKSHIRE                    0.684674
WEST BERKSHIRE                  0.215627
WEST MIDLANDS                   1.813579
WEST SUSSEX                     1.483650
WEST YORKSHIRE                  1.596739
WILTSHIRE                       0.624375
WINDSOR AND MAIDENHEAD          0.315877
WOKINGHAM                       0.292156
WORCESTERSHIRE                  0.554690
WREKIN                          0.121524
WREXHAM                         0.069691
YORK                            0.236191
Name: Price Paid, dtype: float64

In [98]:
print council.size

112

In [99]:
type(council)

pandas.core.series.Series

In [100]:
council.sum()

68.25346347820569

In [103]:
ld['Council'].isnull().any()

False

In [106]:
sum(ld.isnull().any())

4

In [107]:
sum(ld['PostCode'].isnull())

1255